In [1]:
# 导入包
import numpy as np
import pandas as pd

In [4]:
# 创建DataFrame对象
data = pd.DataFrame(
    {"key1": ["one", "two"] * 4 + ["two"], "key2": [1, 1, 1, 2, 2, 2, 3, 4, 4]}
)
data

  key1  key2
0  one     1
1  two     1
2  one     1
3  two     2
4  one     2
5  two     2
6  one     3
7  two     4
8  two     4

In [5]:
# 检测重复情况
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
dtype: bool

In [6]:
# 删除重复数据
data.drop_duplicates()

  key1  key2
0  one     1
1  two     1
3  two     2
4  one     2
6  one     3
7  two     4

In [9]:
# 改造数据，加一列
data["key3"] = np.arange(9)
data

  key1  key2  key3
0  one     1     0
1  two     1     1
2  one     1     2
3  two     2     3
4  one     2     4
5  two     2     5
6  one     3     6
7  two     4     7
8  two     4     8

In [11]:
# 指定根据key2列进行去重操作
data.drop_duplicates(["key2"])

  key1  key2  key3
0  one     1     0
3  two     2     3
6  one     3     6
7  two     4     7

In [12]:
# 指定根据key1和key2列进行去重操作，并且保留租后一次出现的位置
data.drop_duplicates(["key1", "key2"], keep="last")

  key1  key2  key3
1  two     1     1
2  one     1     2
4  one     2     4
5  two     2     5
6  one     3     6
8  two     4     8